{
  "run_id": "579dcb8d-a576-425e-bab2-d6a7acaf8d22",
  "timestamp": "2025-05-08T02-55-27.516682Z",
  "topic": "What are embeddings?",
  "seed_ids": [
    "https://openalex.org/W658020064"
  ],
  "bibliography": "The current literature on embeddings, specifically word embeddings, reveals a deep exploration into their nature and applications. Word embeddings are real-valued word representations that effectively capture lexical semantics and are trained on natural language corpora. These embeddings are known for their seemingly linear behavior and analogical properties, as observed in models like word2vec (W2V), despite not being explicitly trained to do so. This behavior is associated with the parallelogram analogy of words, for instance, \"woman is to queen as man is to king\". \n\nIn terms of understanding why these embeddings work, research indicates that the properties of these embeddings arise from the interactions between PMI vectors that reflect semantic relationships, such as similarity and paraphrasing. These relationships are encoded in a low dimensional space under suitable projection. Moreover, embeddings from vision-language models (VLMs) have been found to have compositional structures, estimated from a smaller set of vectors in the embedding space, which can be used to generate concepts directly.\n\nRecommended Papers:\n\n1. \"Linear Spaces of Meanings: Compositional Structures in Vision-Language Models\" - This paper is important as it provides an understanding of compositional structures in VLM embeddings, and their applicability in different tasks such as classification, debiasing, and retrieval.\n\n2. \"What the Vec? Towards Probabilistically Grounded Embeddings\" - This paper provides valuable insight into the theoretical understanding of word embeddings and explains why their properties are useful in downstream tasks.\n\n3. \"Analogies Explained: Towards Understanding Word Embeddings\" - This paper provides explanations about the linear behavior and analogical properties of word embeddings, making it a key resource for understanding the complexities of these embeddings.\n\n4. \"A Survey of Word Embeddings Evaluation Methods\" - This paper presents an extensive overview of the field of word embeddings evaluation, highlighting significant challenges and approaches. It is crucial for understanding the evaluation methods and the datasets used for word embeddings."
}